{
  "Gender_Age": {
    "None": "",
    "Young Baby Male": "a young baby male",
    "Young Baby Female": "a young baby female",
    "Young Male": "A young male",
    "Young Female": "A young female",
    "Adolescent Male": "an adolescent male",
    "Adolescent Female": "an adolescent female",
    "Young Adult Male": "a young adult male",
    "Young Adult Female": "a young adult female",
    "Middle-Aged Male": "A middle-aged male",
    "Middle-Aged Female": "A middle-aged female",
    "Elder Male": "An elder male",
    "Elder Female": "An elder female"
  },
  "Race": {
    "None": "",
    "Human": "Human",
    "Elf": "Elf",
    "Dwarf": "Dwarf",
    "Orc": "Orc",
    "Halfling": "Halfling",
    "Gnome": "Gnome",
    "Tiefling": "Tiefling",
    "Aasimar": "Aasimar",
    "Genasi": "Genasi",
    "Firbolg": "Firbolg",
    "Kenku": "Kenku",
    "Tabaxi": "Tabaxi",
    "Goliath": "Goliath",
    "Triton": "Triton",
    "Kobold": "Kobold",
    "Aarakocra": "Aarakocra",
    "Dragonborn": "Dragonborn, a dragon-like humanoid race with scales, known for their draconic ancestry"
  },
  "Character_class": {
    "None": "",
    "Warrior": "Warrior",
    "Mage": "Mage",
    "Rogue": "Rogue",
    "Cleric": "Cleric",
    "Ranger": "Ranger",
    "Paladin": "Paladin",
    "Necromancer": "Necromancer",
    "Bard": "Bard",
    "Monk": "Monk",
    "Druid": "Druid",
    "Sorcerer": "Sorcerer",
    "Barbarian": "Barbarian",
    "Assassin": "Assassin"
  },
  "Armor": {
    "None": "",
    "Cloth Armor": "Light and flexible armor providing minimal protection but allowing for maximum agility.",
    "Leather Armor": "Durable armor made of leather, providing a good balance between protection and mobility.",
    "Padded Armor": "Soft armor made from layers of cloth or quilted materials, providing basic protection against light attacks.",
    "Hide Armor": "Armor made from the hides of beasts, offering moderate protection while retaining flexibility.",
    "Studded Leather Armor": "Leather armor reinforced with metal studs, offering enhanced protection without sacrificing too much mobility.",
    "Scale Mail": "Armor composed of small, overlapping metal scales, offering good protection with some flexibility.",
    "Chainmail": "Armor made of interlocking metal rings, offering decent protection with moderate weight.",
    "Splint Armor": "Armor consisting of metal strips attached to a backing of leather or cloth, providing superior protection for limbs.",
    "Ring Mail": "Armor consisting of leather reinforced with metal rings, offering improved protection over basic leather.",
    "Breastplate": "A single-piece chest armor made of metal, providing excellent protection to the torso while allowing agility.",
    "Brigandine": "Armor made of leather or cloth with metal plates sewn inside, providing strong protection with relative flexibility.",
    "Half Plate": "Armor combining metal plates with chainmail and leather, offering solid protection with reduced weight compared to full plate.",
    "Plate Armor": "Heavy armor made of metal plates, offering maximum protection at the cost of reduced mobility.",
    "Full Plate": "Comprehensive armor that covers the entire body with interlocking metal plates, providing the highest level of protection.",
    "Dragon Scale Armor": "Rare and extremely durable armor made from the scales of a dragon, offering resistance to various elements.",
    "Mithril Armor": "Lightweight yet strong armor made from mithril, a rare metal, offering high protection with minimal weight.",
    "Elven Chain": "Exquisite chainmail made by elves, known for its lightness and comfort while providing substantial protection.",
    "Shadow Armor": "Enchanted armor that enhances stealth and grants the wearer the ability to blend into shadows.",
    "Battle Mage Armor": "Specialized armor designed for spellcasters, providing both protection and magical enhancements.",
    "Glass Battle Mage Armor": "Specialized armor designed for spellcasters, providing both protection and magical enhancements.",
    "Fire-Resistant Armor": "Armor specifically designed to provide resistance against fire-based attacks and environments.",
    "Iceforged Armor": "Magically imbued armor that provides resistance against cold and ice-based attacks."
  },
  "Action": {
    "None": "",
    "Attack": "in a battle",
    "Defend": "Taking a defensive stance in battle",
    "Cast Spell": "Casting a magical spell in battle",
    "Stealth": "Moving silently and unseen",
    "Heal": "Using healing magic or potion in battle",
    "Charge": "Rushing into battle with a powerful, aggressive attack",
    "Evade": "Skillfully dodging incoming attacks or obstacles",
    "Sneak Attack": "Performing a surprise attack from the shadows",
    "Meditate": "Taking a moment to recover energy or focus magical powers",
    "Disarm": "Attempting to remove an opponent's weapon or disable a trap",
    "Enrage": "Entering a battle frenzy to increase attack power",
    "Teleport": "Instantly moving from one location to another through magic",
    "Summon": "Calling forth creatures or allies to assist in battle",
    "Enchant": "Using magic to enhance an item or ally’s abilities",
    "Taunt": "Provoking an enemy to draw their attention and attacks away from allies"
  },
  "Environment": {
    "None": "",
    "Forest": "A dense forest filled with tall trees, undergrowth, and the sounds of wildlife.",
    "Dungeon": "A dark and foreboding underground dungeon, filled with traps and hidden dangers.",
    "Castle": "A large stone castle, with towering walls, battlements, and a grand hall.",
    "Village": "A small, quaint village with rustic cottages, a marketplace, and friendly inhabitants.",
    "Mountain": "A towering mountain range, with rugged terrain, cliffs, and breathtaking views.",
    "Swamp": "A murky swamp, with still waters, dense foliage, and the croaking of frogs and insects.",
    "Desert": "A vast expanse of sand dunes under a scorching sun, with mirages in the distance.",
    "Tundra": "A cold and barren landscape with frozen ground and harsh winds.",
    "Cave": "A dark, winding network of tunnels and chambers deep underground.",
    "Ruins": "The crumbling remains of an ancient civilization, filled with hidden traps and secrets.",
    "City": "A bustling urban environment with towering buildings, narrow alleys, and diverse inhabitants.",
    "Temple": "A sacred or cursed place of worship, filled with mystical energies and ancient relics.",
    "Jungle": "A dense, tropical forest with thick underbrush, towering trees, and dangerous wildlife.",
    "Underwater": "A submerged environment, either in the ocean depths or a sunken city, filled with aquatic life and mysteries.",
    "Sky City": "A floating city among the clouds, with airships and flying creatures.",
    "Wasteland": "A desolate, post-apocalyptic environment, with abandoned structures and mutated creatures."
  }
}
